Autodesk.Navisworks.Api.Data.DatabaseException
The exception that is thrown when database failed

Autodesk.Navisworks.Api.Data.DatabaseException.#ctor(System.Int32)
Creates a DatabaseException
errorCode: The error code.

Autodesk.Navisworks.Api.Data.DatabaseException.#ctor(System.Int32,System.String)
Creates a DatabaseException
errorCode: The error code.
message: The error message that explains the reason for the exception.

Autodesk.Navisworks.Api.Data.DatabaseException.#ctor(System.Int32,System.String,System.Exception)
Creates a DatabaseException
errorCode: The error code.
message: The error message that explains the reason for the exception.
innerException: The exception that is the cause of the current exception. If the innerException parameter is not null, the current exception is raised in a catch block that handles the inner exception.

Autodesk.Navisworks.Api.Data.DatabaseException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Creates a DatabaseException

Autodesk.Navisworks.Api.Data.DatabaseException.ErrorCode
Get database failed error code.